try:
    time = int(input('Введите час (0–23):')) #Заправшием время
    if time >= 0 and time <= 5: #Если время 0 до 5 включительно - ночь
        print('Сейчас ночь')
    elif time >= 6 and time <= 11: #Если время 6 до 11 включительно - утро
        print('Сейчас утро')
    elif time >= 12 and time <= 17: #Если время 12 до 17 включительно - день
        print('Сейчас день')
    elif time >= 18 and time <= 23: #Если время 0 до 5 включительно - вечер
        print('Сейчас вечер')
    else:
        print('Время введено неверно!')#Если больше 24 или меньше 0 - пользователь допустил ошибку

except ValueError:
    print('Число введенно неверно')
