a_max_name = ''
a_min_name = ''
b_max_name = ''
b_min_name = ''
c_max_name = ''
c_min_name = ''
a = {
    "Амур" : [4416,350,1855,"Яблоневый хребет","Татарский пролив"],
    "Лена" : [4400,488,2490,"Байкальсий хребет","Море Лаптевых"],
    "Обь" : [4070,400,2990,"Предгорья Алтая","Карское море"],
    "Иртыш" : [4248,323,1643,"Китай","Обь"],
    "Енисей" : [3487,600,2580,"Восточный Саян","Карское море"],
    "Волга" : [3530,255,1360,"Валдайская возвышенность","Каспийское море"],
    "Колыма" : [2129,44,643,"Хребет Черского","Восточносибирское море"],
    "Урал" : [2428,54,231,"Южный Урал","Каспийское море"],
    "Дон" : [2200,45,504,"Среднерусская возвышенность","Азовское море"],
    "Кама" : [1805,130,507,"Верхне-Каменская возвышенность","Волга"],
    "Печора" : [1809,130,322,"Северный Урал","Баренцево море"],
    "Ангара" : [1779,62,1039,"Байкал","Енисей"],
    "Селенга" : [1024,14,447,"Монголия","Байкал"],
    "Кубань" : [870,11,58,"Кавказ","Азовское море"]
}
b = ["Амур","Лена","Обь","Иртыш","Енисей","Волга","Колыма","Урал","Дон","Кама","Печора","Ангара","Селенга","Кубань"]
a_max = 0
a_min = 100000
b_max = 0
b_min = 100000
c_max = 0
c_min = 100000
for i in range(14):
    if a[b[i]][0] > a_max:
        a_max = a[b[i]][0]
        a_max_name = b[i]
    if a[b[i]][0] < a_min:
        a_min = a[b[i]][0]
        a_min_name = b[i]
    if a[b[i]][1] > b_max:
        b_max = a[b[i]][1]
        b_max_name = b[i]
    if a[b[i]][1] < b_min:
        b_min = a[b[i]][1]
        b_min_name = b[i]
    if a[b[i]][2] > c_max:
        c_max = a[b[i]][2]
        c_max_name = b[i]
    if a[b[i]][2] < c_min:
        c_min = a[b[i]][2]
        c_min_name = b[i]
print('По длине, максимальное:'+a_max_name+' минимальное:'+a_min_name)
print('По годовому стоку, максимальное:'+b_max_name+' минимальное:'+b_min_name)
print('По площади бассейна, максимальное:'+c_max_name+' минимальное:'+c_min_name)