a = {
    "Амур" : [4416,350,1855,"Яблоневый хребет","Татарский пролив"],
    "Лена" : [4400,488,2490,"Байкальсий хребет","Море Лаптевых"],
    "Обь" : [4070,400,2990,"Предгорья Алтая","Карское море"],
    "Иртыш" : [4248,323,1643,"Китай","Обь"],
    "Енисей" : [3487,600,2580,"Восточный Саян","Карское море"],
    "Волга" : [3530,255,1360,"Валдайская возвышенность","Каспийское море"],
    "Колыма" : [2129,44,643,"Хребет Черского","Восточносибирское море"],
    "Урал" : [2428,54,231,"Южный Урал","Каспийское море"],
    "Дон" : [2200,45,504,"Среднерусская возвышенность","Азовское море"],
    "Кама" : [1805,130,507,"Верхне-Каменская возвышенность","Волга"],
    "Печора" : [1809,130,322,"Северный Урал","Баренцево море"],
    "Ангара" : [1779,62,1039,"Байкал","Енисей"],
    "Селенга" : [1024,14,447,"Монголия","Байкал"],
    "Кубань" : [870,11,58,"Кавказ","Азовское море"]
}
b = ["Амур","Лена","Обь","Иртыш","Енисей","Волга","Колыма","Урал","Дон","Кама","Печора","Ангара","Селенга","Кубань"]
for i in range(14):
    if a["Кама"][0] > a[b[i]][0] or a[b[i]][3] == "Байкал":
        print(b[i])
print('----------------------')
for i in range(14):
    if  a[b[i]][0] > a["Енисей"][0] and a["Лена"][2] > a[b[i]][2]:
        print(b[i])
print('----------------------')
for i in range(14):
    if  a[b[i]][4] == "Азовское море" or not(a[b[i]][0] > a["Урал"][0]):
        print(b[i])
print('----------------------')
d = True
for i in range(14):
    for j in range(14):
        if a["Амур"][0] > a[b[i]][0] or a["Обь"][2] > a[b[i]][2] == 0:
            d = False
print(d)
print('----------------------')
e = False
for i in range(14):
    for j in range(14):
        if a["Лена"][2] > a[b[i]][2] and not(a[b[i]][3] == "Байкал"):
            e = True
print(e)